Revit 2026 API

# ParameterTypeIdEnergyAnalysisSillHeight Property

---

"Target Sill Height"

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public static ForgeTypeId EnergyAnalysisSillHeight { get; }
```
```vb
Public Shared ReadOnly Property EnergyAnalysisSillHeight As ForgeTypeId
	Get
```
```cpp
public:
static property ForgeTypeId^ EnergyAnalysisSillHeight {
	ForgeTypeId^ get ();
}
```
```fsharp
static member EnergyAnalysisSillHeight : ForgeTypeId with get
```

#### Property Value

ForgeTypeId

#### Reference

ParameterTypeId Class

Autodesk.Revit.DB Namespace